# Assignment

#### What is a database? Differentiate between SQL and NoSQL databases.

1. Database is organized collection of data so that it can be easily accessed.
2. SQL --> Structured Query Language. 
3. Sql database is a relational database which contains rows and columns in the formm of tables where each row indicates data entity and every column defines a specific information field.
4. It uses Structured Query Language to create,store,update and retrieve data.
5. NOSQL --> Not Only Structured Query Language.
6. NoSQL is a non-relational database.
7. It does not store data in the form of tables. 
8. For example --> 
    1. SQL - MySQL
    2. NOSQL - MongoDB

#### What is DDL? Explain why CREATE, DROP, ALTER, and TRUNCATE are used with an example.

1. DDL - Data Definition Language
2. It is a subset of SQL and a part of DBMS contains commands like CREATE,DROP,ALTER AND TRUNCATE.
3. CREATE command is used to create a new table in sql in which we have to specify the column names with its data types. 
    1. CREATE TABLE table_name (col1 datatype, col2 datatype, col3 datatype ,..............,col4 datatype);
4. DROP command is used to remove the existing table from the database along with its structure. 
    2. DROP TABLE table_name;
5. ALTER command is used to add,delete or change columns in existing table or more precisely it is used to modify the columns.
    3. ALTER TABLE table_name add column_name datatype;
6. TRUNCATE command is used to remove all rows from the existing table but the structures still exists. 
    4. TRUNCATE TABLE table_name;
7. For example ->

> CREATE TABLE test_table (name VARCHAR(50),Age INT);

> ALTER TABLE test_table add name varchar(50);

> TRUNCATE TABLE test_table;

> DROP TABLE test_table;

#### What is DML? Explain INSERT, UPDATE, and DELETE with an example.

1. DML is Data Manipulation Language which contains commands like INSERT,UPDATE and DELETE.
2. INSERT command is used to insert data into a table.
3. UPDATE command is used to update data present in the existing table.
4. DELETE command is used to delete records from a database table.
5. For example ->

> INSERT INTO test_table VALUES(50,'pwskills','sudh','krish');

> UPDATE test_table name='Sudhanshu Kumar' WHERE Age =22;

> DELETE FROM test_table where name='Sudhanshu Kumar';

#### What is DQL? Explain SELECT with an example.

1. DQL is DATA QUERY LANGUAGE.
2. DQL is used to retrieve data from the table and using it to perform various opertions on it. 
3. It includes SELECT statement. 
4. SELECT is used to retrieve data from the table by specifying column name or we can get all the data present at the same time.
5. SELECT * FROM table_name; is used to retrieve all the data from that particular table. 
6. SELECT column_1, column_2 FROM table_name; is used to retrieve data from specific columns mentioned in the command. 
6. For example ->

> CREATE TABLE Student(Name VARCHAR(50), Age INT, Marks float) ;

> INSERT INTO Student VALUES('Sumit',12,88.80);

> INSERT INTO Student VALUES('Sneha',12,89,00);

> SELECT * FROM Student;

#### Explain Primary Key and Foreign Key.

#### PRIMARY KEY ->
1. A Primary Key is used to ensure that the data in a specific column is unique. 
2. It does not contain NULL values. 
3. It helps in uniquely finding the data in the table.
4. The Primary Key column can't store duplicate values. 

#### FOREIGN KEY ->
1. A Foreign Key is used to give the relation between two tables. 
2. It is group of one or more columns to uniquely identify another database. 
3. The Foreign Key always matches the Primary Key in another table. 
4. It is beneficial in relational database normalization.

#### Write a python code to connect MySQL to python. Explain the cursor() and execute() method.

> import mysql.connector

> conn = mysql.connector.connect(user='root',password='Manyog@85')

> mycursor = conn.cursor()

> mycursor.execute('CREATE TABLE Student(Name varchar(50), Age INT)')
> conn.commit()
> conn.close()

#### Give the order of execution of SQL clauses in an SQL query.

1. The SQL order of execution defines the order in which the clauses of query has to be executed. 
2. The queries are not evaluated from top to bottom.
3. The order in which the SQL query executes is as follows : 

> FROM/JOIN

> WHERE

> GROUP BY 
 
> HAVING

> SELECT

> ORDER BY